{"status":"ok","totalResults":38,"articles":[{"source":{"id":null,"name":"India Education Diary"},"author":"India Education Diary Bureau Admin","title":"Hester acquires technology from ICAR – NIHSAD to develop a Low Pathogenic Avian Influenza (H9N2 strain) Inactivated Vaccine for poultry - India Education Diary","description":"Hester has signed an agreement towards receiving indigenously developed technology from Indian Council of Agricultural Research - National Institute of High Security Animal Diseases (ICAR-NIHSAD), for the development and commercialization of the Low","url":"https://indiaeducationdiary.in/hester-acquires-technology-from-icar-nihsad-to-develop-a-low-pathogenic-avian-influenza-h9n2-strain-inactivated-vaccine-for-poultry/","urlToImage":"https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/12/Singing-of-the-agreement-on-27-December-2022-at-the-office-of-Agrinnovate-India-New-Delhi-scaled.jpg?fit=1024%2C525&ssl=1","publishedAt":"2022-12-28T12:21:32Z","content":"Hester has signed an agreement towards receiving indigenously developed technology from Indian Council of Agricultural Research – National Institute of High Security Animal Diseases (ICAR-NIHSAD), fo… [+2433 chars]"},{"source":{"id":null,"name":"India Today"},"author":"India Today Web Desk","title":"A blurry telescope: Three-quarters of global observatories hit by light pollution - India Today","description":"Researchers from Italy, Chile, and Galicia have analysed and compared the light pollution levels at major astronomical observatories.","url":"https://www.indiatoday.in/science/story/a-blurry-telescope-three-quarters-of-global-observatories-hit-by-light-pollution-2314616-2022-12-28","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/iao-sixteen_nine.jpg?VersionId=6zuwTQ6oB90yZN9qMsSkG5HuPiQBM2ME","publishedAt":"2022-12-28T11:40:31Z","content":"By India Today Web Desk: Amid the growing challenge of climate change and cloudy weather at observatories that look into the sky, a new study indicates another big hurdle in their path. Researchers h… [+3020 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"PTI","title":"India may see Covid surge in January, next 40 days crucial: Report - Hindustan Times","description":"Amid a spike in Covid-19 cases in some countries, including China and South Korea, the government has sounded an alert and asked states and Union territories to prepare for any eventuality. | Latest News India","url":"https://www.hindustantimes.com/india-news/india-may-see-covid-surge-in-january-next-40-days-crucial-101672223484255.html","urlToImage":"https://images.hindustantimes.com/img/2022/12/28/1600x900/Union-Minister-of-Health-and-Family-Welfare-Mansuk_1672164991196_1672223571338_1672223571338.jpg","publishedAt":"2022-12-28T11:08:35Z","content":"The next 40 days are going to be crucial as India may see a surge in Covid-19 cases in January, official sources said on Wednesday citing the pattern of previous outbreaks.\r\n\"Previously, it has been … [+954 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"Health Minister To Visit Airport As 31 International Fliers Test Positive - NDTV","description":"Thirty-nine people arriving in India from abroad have tested positive for Covid at  airports across the country over the last two days, sources have told NDTV. Union health minister Mansukh Mandaviya will visit Delhi's Indira Gandhi International air","url":"https://www.ndtv.com/india-news/39-international-travellers-test-positive-at-indian-airports-in-2-days-3644575","urlToImage":"https://c.ndtvimg.com/2021-12/h0tb5pt8_covid-airport-generic-afp-world_625x300_30_December_21.jpg","publishedAt":"2022-12-28T11:04:00Z","content":"Mansukh Mandaviya said, \"To ensure there is no Covid surge, PM Modi has asked us to be careful\".\r\nNew Delhi: Thirty-nine people arriving in India from abroad have tested positive for Covid at airport… [+2009 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Andrew Jones","title":"China unveils plans for the largest optical telescope in Asia - Space.com","description":"The project resembles an Earth-bound James Webb Space Telescope.","url":"https://www.space.com/china-expanding-optical-telescope-design","urlToImage":"https://cdn.mos.cms.futurecdn.net/AroqSNSGZkfhWqRDKMkjPQ-1200-80.jpeg","publishedAt":"2022-12-28T11:00:28Z","content":"Peking University wants to build the largest optical telescope in Asia and close the gap in astronomy capabilities with the rest of the world.\r\nThe project aims to create an initial telescope\r\n with … [+2658 chars]"},{"source":{"id":null,"name":"123telugu.com"},"author":null,"title":"Ponniyin Selvan 2 – Release date announced - 123telugu","description":"Telugu cinema news, Telugu Movies Updates, Latest Movie reviews in Telugu, Telugu cinema reviews, telugu movie reviews, Tollywood, Box office collections, Telugu Movie show times, Theater List, telugu cinema tickets","url":"https://www.123telugu.com/mnews/ponniyin-selvan-2-release-date-announced.html","urlToImage":"https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif","publishedAt":"2022-12-28T10:34:00Z","content":"Legendary director Mani Ratnam has ultimately fulfilled his wish by making a film on the famous Tamil novel Ponniyin Selvan. Made as a PAN Indian film, the movie is now a new industry hit in Tamil. I… [+1033 chars]"},{"source":{"id":null,"name":"YouTube"},"author":null,"title":"LIVE: SpaceX launches next batch of Starlink satellites - Firstpost","description":"SpaceX launches the next batch of Starlink satellites aboard its Falcon 9 rocket into space from Cape Canaveral, Florida.#Firstpost #live #news #Starlink #Sp...","url":"https://www.youtube.com/watch?v=kCvz1E5c_jU","urlToImage":"https://i.ytimg.com/vi/kCvz1E5c_jU/maxresdefault.jpg","publishedAt":"2022-12-28T09:46:01Z","content":null},{"source":{"id":null,"name":"Moneycontrol"},"author":"Arvin Vincent","title":"LIVE Coronavirus BF.7 Variant in India Updates: Mother-child duo, returning from China, test positive at Madurai airport; Taiwan to test arrivals from China from January 1 - Moneycontrol","description":"Coronavirus BF.7 Variant Updates: &quot;A group of 11 tourists from Myanmar was brought to the hospital from the airport on Sunday. They were kept in the isolation ward. Now, all of them have tested negative and are being discharged,&quot; a senior doctor sai…","url":"https://www.moneycontrol.com/news/coronavirus/coronavirus-bf-7-variant-in-india-updates-9773911.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2022/12/covid.png","publishedAt":"2022-12-28T09:43:48Z","content":"<li>Eleven Myanmar tourists isolated at Safdarjung Hospital after one tested positive for Covid \r\n</li><li>I will hold a meeting on the Covid-19 situation in the State today: Himachal Pradesh CM \r\n</… [+2275 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"ET Spotlight Special","title":"Garena Free Fire Max: Codes out for December 28, get free gifts, weapons, skins and more - Economic Times","description":"Get exclusive diamonds,  new skins, weapons and many more cool vouchers for your game via today's daily redeem codes. Also get a chance to win free high graded weapons and skins.","url":"https://economictimes.indiatimes.com/news/new-updates/garena-free-fire-max-codes-out-for-december-28-get-free-gifts-weapons-skins-and-more/articleshow/96567001.cms","urlToImage":"https://img.etimg.com/thumb/msid-96567765,width-1070,height-580,imgsize-54828,overlay-economictimes/photo.jpg","publishedAt":"2022-12-28T09:38:00Z","content":"Garena Free Fire Max codes are out for December 28 and can be used for upgrading skins, outfits, weapons etc. The good information for the fans of this multiplayer royale game is that there is still … [+1873 chars]"},{"source":{"id":null,"name":"International Cricket Council"},"author":"ICC","title":"ICC Men's Emerging Cricketer of the Year 2022 nominees revealed - ICC Cricket","description":"Two left-arm quicks and a pair of openers are the four men in the running to take out the ICC Men’s Emerging Cricketer of the Year award for 2022. We take a look at their respective breakout years.","url":"https://www.icc-cricket.com/news/2995519","urlToImage":"https://resources.pulse.icc-cricket.com/ICC/photo/2022/12/28/6446659f-f4b8-4d28-b2d4-904cd00a0dcb/Arshdeep-emerging.jpg","publishedAt":"2022-12-28T09:31:37Z","content":"Two left-arm quicks and a pair of openers are the four men in the running to take out the ICC Mens Emerging Cricketer of the Year award for 2022. We take a look at their respective breakout years.Mar… [+6146 chars]"},{"source":{"id":null,"name":"Www.bgr.in"},"author":"Pranav Sawant","title":"Moto E13 design leaked before launch in 2023: Check details - BGR India","description":"Motorola is expected to launch a couple of new phones next year and one of them will be the entry-level Moto E13 smartphone. A single camera a water-drop notch panel and a Unisoc SoC is everything you expect.","url":"https://www.bgr.in/mobiles/moto-e13-design-surfaced-ahead-of-launch-in-2023-1352767/","urlToImage":"https://st1.bgr.in/wp-content/uploads/2022/12/Moto-E13-2.jpg","publishedAt":"2022-12-28T09:08:29Z","content":"Motorola Moto E13 will be the brand’s next entry-level phone in multiple markets. So far we have learned a couple of its key specs via Geekbench and a brief design leak was done online that showed ho… [+1947 chars]"},{"source":{"id":null,"name":"Moneycontrol"},"author":"Pavan Lall","title":"Redefining scale: Two decades of Mukesh Ambani at the helm of Reliance Industries - Moneycontrol","description":"Visionary billionaire Mukesh Ambani's repertoire includes thinking big, new-age ventures, and relentless execution.","url":"https://www.moneycontrol.com/news/business/redefining-scale-two-decades-of-mukesh-ambani-at-the-helm-of-reliance-industries-9774681.html","urlToImage":"https://images.moneycontrol.com/static-mcnews/2021/06/IMG-20210624-WA0005-1-770x433.jpg","publishedAt":"2022-12-28T08:58:20Z","content":"For a college student who pulled out of Stanford University to go back to Reliance Industries Limited (RIL) and spearhead its expansion into polyester and petrochemicals, setting up its first big man… [+7706 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":null,"title":"PM's Mother, 99, Admitted In Ahmedabad, Hospital Says \"Condition Stable\" - NDTV","description":"Prime Minister Narendra Modi's mother Heeraben Modi has been hospitalised after her health deteriorated last night.","url":"https://www.ndtv.com/india-news/pm-modis-mother-age-99-hospitalised-in-ahmedabad-3644178","urlToImage":"https://c.ndtvimg.com/2022-12/tgj74ibc_narendra-modi-mother_625x300_04_December_22.jpg","publishedAt":"2022-12-28T08:36:00Z","content":"The hospital has said that Heeraben Modi's condition is stable\r\nAhmedabad: Prime Minister Narendra Modi's mother Heeraben Modi has been hospitalised after her health deteriorated last night.\r\nHeerabe… [+972 chars]"},{"source":{"id":null,"name":"NDTV News"},"author":"NDTV Sports Desk","title":"Rizwan Runs Show, Sarfaraz Takes DRS As Confusion Reigns Over Pakistan's Stand-In Captain On Day 3 O.. - NDTV Sports","description":"It was unclear whether Pakistan knowingly flouted this rule or were complete unaware of it, but the point was raised by many on social media and it soon became a hot potato.","url":"https://sports.ndtv.com/cricket/confusion-over-pakistans-stand-in-captain-rizwan-runs-show-sarfaraz-takes-drs-3644217","urlToImage":"https://c.ndtvimg.com/2022-12/tbg86d58_rizwan-captaincy-blunder_625x300_28_December_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675","publishedAt":"2022-12-28T08:23:18Z","content":"Cricket fans and followers witnessed something unusual of the third day of the first Test match between Pakistan and New Zealand. With news coming in that Pakistan captain Babar Azam will not take th… [+1666 chars]"},{"source":{"id":null,"name":"The Indian Express"},"author":"Express News Service","title":"In letter to Amit Shah, Congress alleges ‘security breaches’ in Bharat Jodo Yatra, blames Delhi Police - The Indian Express","description":"The party has been claiming that intelligence operatives belonging to the BJP-led Haryana government had illegally entered one of the campsites of the yatra when it was passing through the state.","url":"https://indianexpress.com/article/political-pulse/safety-rahul-gandhi-bharat-jodo-yatra-congress-amit-shah-8348216/","urlToImage":"https://images.indianexpress.com/2022/12/rahul-delhi-logo.png","publishedAt":"2022-12-28T07:41:57Z","content":"The Congress wrote to Union Home Minister Amit Shah Wednesday alleging “significant security breaches” in the Bharat Jodo Yatra when it entered the national capital last week and blaming the Delhi Po… [+2636 chars]"},{"source":{"id":null,"name":"Hindustan Times"},"author":"HT Entertainment Desk","title":"Shekhar Suman reacts to 'sensational' claims in Sushant Singh Rajput death case - Hindustan Times","description":"Shekhar Suman has responded to the recent claims that Sushant Singh Rajput was murdered and did not die of suicide, and has urged the CBI to look into the matter. | Bollywood","url":"https://www.hindustantimes.com/entertainment/bollywood/shekhar-suman-reacts-to-sensational-claims-in-sushant-singh-rajput-death-case-101672210248375.html","urlToImage":"https://images.hindustantimes.com/img/2022/12/28/1600x900/_e59c2f12-3d53-11eb-b180-736642f23257_1672215925235_1672215925235.jpg","publishedAt":"2022-12-28T07:39:26Z","content":"Days after fresh claims of the late actor being murdered surfaced, Shekhar Suman has demanded reopening of the case related to the death of Sushant Singh Rajput in 2020. (Also read: Sushant Singh Raj… [+2172 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"'Ex boyfriend tu hai ya main': Video of Salman Khan stopping bodyguard Shera from opening ex-girlfriend Sangeeta Bijlani's car door gets hilarious reactions - Times of India","description":"Salman Khan hosted a grand party on the eve of his 57th birthday. His ex-girlfriend and now close friend Sangeeta Bijlani was also among the VIP guests at Salman's party. Now, a video is grabbing attention where Salman, Sangeeta and Shera were waiting outside…","url":"https://timesofindia.indiatimes.com/videos/entertainment/hindi/ex-boyfriend-tu-hai-ya-main-video-of-salman-khan-stopping-bodyguard-shera-from-opening-ex-girlfriend-sangeeta-bijlanis-car-door-gets-hilarious-reactions/videoshow/96564335.cms","urlToImage":"https://timesofindia.indiatimes.com/photo/96564335/size-43152/96564335.jpg","publishedAt":"2022-12-28T07:23:04Z","content":"Salman Khan\r\n hosted a grand party on the eve of his 57th birthday. His ex-girlfriend and now close friend Sangeeta Bijlani was also among the VIP guests at Salman's party. Now, a video is grabbing a… [+656 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Anand JC","title":"Politically deft Modi govt creates more fiscal space ahead of Budget 2023 - Economic Times","description":"In one fell swoop, Prime Minister Narendra Modi-led administration has addressed the fiscal pinch caused by the Pradhan Mantri Garib Kalyan Ann Yojana (PMGKAY) and the political pain it wouldve experienced after announcing a rollback. Economists have cheered …","url":"https://economictimes.indiatimes.com/news/economy/policy/politically-deft-modi-govt-creates-more-fiscal-space-ahead-of-budget-2023/articleshow/96564263.cms","urlToImage":"https://img.etimg.com/thumb/msid-96564311,width-1070,height-580,imgsize-62662,overlay-economictimes/photo.jpg","publishedAt":"2022-12-28T07:23:00Z","content":"The Indian government recently decided to end its fiscally draining Covid-era free food programme and made its existing NFSA programme free of cost for a year. \r\nIn one fell swoop, Prime Minister Nar… [+3599 chars]"},{"source":{"id":null,"name":"News18"},"author":"Entertainment Bureau","title":"Tunisha Sharma Suicide Case: Sheezan Khan's 'Secret' Girlfriend Identified? Here's What We Know - News18","description":"In a new development in Tunisha Sharma's suicide case, it is claimed that the police officials have identified Sheezan Khan's 'secret' girlfriend and she will be brought in for question.","url":"https://www.news18.com/news/movies/tunisha-sharma-suicide-case-sheezan-khans-secret-girlfriend-identified-heres-what-we-know-6709093.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2022/12/sheezan-khan-tunisha-sharma-167196689016x9.jpg","publishedAt":"2022-12-28T07:05:56Z","content":"Actor Sheezan Khans secret girlfriend has been identified if a new report regarding Tunisha Sharmas suicide case is to be believed. The actor, who briefly dated his Ali Baba: Dastaan-E-Kabul co-star,… [+2199 chars]"},{"source":{"id":null,"name":"Rediff.com"},"author":"REUTERS","title":"India to host 2036 Olympics ? - Rediff.com","description":"India 'seriously' considering bid for 2036 Games, says sports minister","url":"https://www.rediff.com/sports/report/india-to-host-2036-olympics-/20221228.htm","urlToImage":"https://im.rediff.com/sports/2021/jul/21india2.jpg","publishedAt":"2022-12-28T07:01:32Z","content":"'India is looking very seriously at bidding for the 2036 Olympic'\r\nPhotograph: Kind Courtesy Sports Authority of India\r\nIndia is 'seriously' considering a bid to host the 2036 Olympic Games, sports m… [+1621 chars]"}]}